Autodesk.Revit.DB.FindReferenceTarget
The type of reference to find from a ReferenceIntersector.
Since:
2013
The type of reference to find
Since:
2013

Autodesk.Revit.DB.FindReferenceTarget.All
All target types.

Autodesk.Revit.DB.FindReferenceTarget.Face
A face.

Autodesk.Revit.DB.FindReferenceTarget.Curve
A curve.

Autodesk.Revit.DB.FindReferenceTarget.Edge
An edge.

Autodesk.Revit.DB.FindReferenceTarget.Mesh
A mesh.

Autodesk.Revit.DB.FindReferenceTarget.Element
An element.